In [43]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\hp\appdata\local\programs\python\python312\lib\site-packages (2.0.36)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\hp\appdata\local\programs\python\python312\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\hp\appdata\local\programs\python\python312\lib\site-packages (from sqlalchemy) (3.1.1)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [44]:
import requests
import pandas as pd
import numpy as np
import sys
import os
import psycopg2
from sqlalchemy import create_engine
from psycopg2 import OperationalError, errorcodes, errors 
import os
import dotenv # type: ignore
dotenv.load_dotenv()

sys.path.append(os.path.abspath('../'))
from src import soporte_tablas as st

In [45]:
df_artistas = pd.read_csv('../datos/detalles_artistas.csv')
df_peliculas_detalles = pd.read_csv('../datos/detalles_peliculas.csv')
df_pelicula_artista = pd.read_csv('../datos/pelicula_artista.csv')
df_peliculas = pd.read_csv('../datos/peliculas.csv')

In [46]:
df_artistas = df_artistas.rename(columns={'actr':'Actriz_Actor'})
df_artistas.head(2)

,Actriz_Actor,año_nac,conocido_por,que_hace,premios
0,A. Gunaseelan,9999,'Mandela',"Casting Department, Actress, Casting Director",1 nomination
1,A. Michelle Harleston,9999,"'Murder by Numbers', 'The Mark of a Killer', '...",Actor,no tiene premios

In [47]:
df_peliculas_detalles = df_peliculas_detalles.rename(columns={'id_pelicula':'Id'})
df_peliculas_detalles.head(2)

,titulo,cali_imdb,direc_imbd,guion_imbd,argum_imbd,durac_imbd,Id
0,Las Travesuras de Super Chido,7.7,Alejandro Todd,Óscar FentanesJuan Garrido,Desconocido,1h 35min,tt0320656
1,Velai Kidaichiruchu,5.2,P. Vasu,SathyarajGautamiAnandraj,"Baasha, a gangster, controls a whole village w...",Desconocido,tt0318803

In [48]:
df_pelicula_artista = df_pelicula_artista.rename(columns={'Movie ID':'Id'})
df_pelicula_artista.head(2)
df_pelicula_artista.head(2)

          Id       Actriz_Actor
0  tt0110660  Tony Ka Fai Leung
1  tt0110363       Luke Edwards

In [49]:
df_peliculas.head(2)

    Tipo                         Titulo   Año  Mes         Id generos
0  Movie  Las Travesuras de Super Chido  1990   10  tt0320656  Action
1  Movie            Velai Kidaichiruchu  1990    8  tt0318803  Action

In [50]:
USER = os.getenv("USER")
PASSWORD = os.getenv("PASSWORD")

In [51]:
# Create connection to Snowflake using your account and user
account_identifier = 'localhost'
user = USER
password = PASSWORD
#engine = create_engine("postgresql+psycopg2://scott:tiger@localhost:5432/mydatabase")
conn_string = f"postgresql+psycopg2://{user}:{password}@{account_identifier}:5432/IMDB"
engine = create_engine(conn_string)

In [52]:
 
table_name = 'Artistas'

if_exists = 'replace'
 
with engine.connect() as con:
 df_artistas.to_sql(
 name=table_name.lower(), 
 con=con, 
 if_exists=if_exists
 )

In [53]:
 
table_name = 'Artistas_detalles'

# What to do if the table exists? replace, append, or fail?
if_exists = 'replace'
 
# Write the data to Snowflake
with engine.connect() as con:
 df_peliculas_detalles.to_sql(
 name=table_name.lower(), 
 con=con, 
 if_exists=if_exists)

In [54]:
 
table_name = 'pelicula_artista'

# What to do if the table exists? replace, append, or fail?
if_exists = 'replace'
 
# Write the data to Snowflake
with engine.connect() as con:
 df_pelicula_artista.to_sql(
 name=table_name.lower(), 
 con=con, 
 if_exists=if_exists)

In [55]:
table_name = 'pelicula'

# What to do if the table exists? replace, append, or fail?
if_exists = 'replace'
 
# Write the data to Snowflake
with engine.connect() as con:
 df_peliculas.to_sql(
 name=table_name.lower(), 
 con=con, 
 if_exists=if_exists)